ViniBR01/stm32-bare-metal/drivers/src/uart.c
#include <stdint.h>
#include <stddef.h>

#include "gpio_handler.h"
#include "rcc.h"
#include "stm32f4xx.h"
#include "uart.h"

/* Register bit definitions - USART */
#define UART2EN                (1U<<17)
#define CR1_RE                 (1U<<2)
#define CR1_TE                 (1U<<3)
#define CR1_UE                 (1U<<13)
#define CR1_RXNEIE             (1U<<5)
#define CR1_TCIE               (1U<<6)
#define CR1_IDLEIE             (1U<<4)
#define CR3_DMAT               (1U<<7)
#define CR3_EIE                (1U<<0)
#define SR_TXE                 (1U<<7)
#define SR_RXNE                (1U<<5)
#define SR_TC                  (1U<<6)
#define SR_IDLE                (1U<<4)
#define SR_ORE                 (1U<<3)
#define SR_NF                  (1U<<2)
#define SR_FE                  (1U<<1)

/* Register bit definitions - DMA */
#define DMA1EN                 (1U<<21)
#define DMA_SxCR_CHSEL_CH4     (4U<<25)
#define DMA_SxCR_DIR_MEM2PER   (1U<<6)

/* Configuration constants */
#define UART_BAUDRATE          115200

/* Internal state variables */
static volatile uint8_t tx_busy = 0;
static uart_tx_complete_callback_t tx_complete_callback = NULL;
static uart_rx_callback_t rx_callback = NULL;
static volatile uart_error_flags_t error_flags = {0};

/* Private function prototypes */
static uint16_t compute_uart_bd(uint32_t periph_clk, uint32_t baudrate);
static void uart_set_baudrate(uint32_t periph_clk, uint32_t baudrate);
static void uart_dma_init(void);
static void uart_nvic_init(void);

void uart_init(void) {
    /* Enable GPIOA clock and configure PA2 (TX) and PA3 (RX) */
    gpio_clock_enable(GPIO_PORT_A);
    gpio_configure_pin(GPIO_PORT_A, 2, GPIO_MODE_AF);
    gpio_configure_pin(GPIO_PORT_A, 3, GPIO_MODE_AF);
    
    /* Set PA2 alternate function to UART_TX (AF7) */
    GPIOA->AFR[0] &= ~(0xF<<8);  // Clear AF for PA2
    GPIOA->AFR[0] |= (7U<<8);    // Set AF7 (USART2_TX)
    
    /* Set PA3 alternate function to UART_RX (AF7) */
    GPIOA->AFR[0] &= ~(0xF<<12); // Clear AF for PA3
    GPIOA->AFR[0] |= (7U<<12);   // Set AF7 (USART2_RX)
    
    /* Enable UART2 clock */
    RCC->APB1ENR |= UART2EN;
    
    /* Configure baudrate */
    uart_set_baudrate(rcc_get_apb1_clk(), UART_BAUDRATE);
    
    /* Enable transmitter, receiver, and UART module */
    USART2->CR1 |= CR1_TE;
    USART2->CR1 |= CR1_RE;
    USART2->CR1 |= CR1_UE;
    
    /* Initialize DMA for TX */
    uart_dma_init();
    
    /* Enable UART DMA mode for transmitter */
    USART2->CR3 |= CR3_DMAT;
    
    /* Enable UART interrupts for RX and errors */
    USART2->CR1 |= CR1_RXNEIE;  // RX not empty interrupt
    USART2->CR1 |= CR1_IDLEIE;  // Idle line interrupt
    USART2->CR3 |= CR3_EIE;     // Error interrupt
    
    /* Configure NVIC for UART and DMA interrupts */
    uart_nvic_init();
}

char uart_read(void) {
    /* Wait until RXNE (Read data register not empty) flag is set */
    while (!(USART2->SR & SR_RXNE));
    
    /* Read and return the received character */
    return (char)(USART2->DR & 0xFF);
}

void uart_write(char ch) {
    /* If sending a newline, transmit carriage return first for proper
       terminal display (LF -> CRLF conversion) */
    if (ch == '\n') {
        while (!(USART2->SR & SR_TXE));
        USART2->DR = ('\r' & 0xFF);
    }
    
    /* Wait until transmit data register is empty */
    while (!(USART2->SR & SR_TXE));
    
    /* Write character to transmit data register */
    USART2->DR = (ch & 0xFF);
}

// TODO: This function should return a value indicating success or failure
void uart_write_dma(const char* data, uint16_t length) {
    /* Check if DMA is already busy */
    if (tx_busy || length == 0) {
        return;
    }
    
    /* Mark TX as busy */
    tx_busy = 1;
    
    /* Disable DMA stream to configure */
    DMA1_Stream6->CR &= ~DMA_SxCR_EN;
    
    /* Wait until DMA stream is disabled */
    while (DMA1_Stream6->CR & DMA_SxCR_EN);
    
    /* Clear all interrupt flags for stream 6 */
    DMA1->HIFCR = DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTEIF6 | 
                  DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6;
    
    /* Configure DMA stream */
    DMA1_Stream6->M0AR = (uint32_t)data;         // Memory address
    DMA1_Stream6->NDTR = length;                  // Number of data items
    
    /* Enable DMA stream */
    DMA1_Stream6->CR |= DMA_SxCR_EN;
}

void uart_register_rx_callback(uart_rx_callback_t callback) {
    rx_callback = callback;
}

void uart_register_tx_complete_callback(uart_tx_complete_callback_t callback) {
    tx_complete_callback = callback;
}

uart_error_flags_t uart_get_errors(void) {
    return error_flags;
}

void uart_clear_errors(void) {
    error_flags.overrun_error = 0;
    error_flags.framing_error = 0;
    error_flags.noise_error = 0;
}

uint8_t uart_is_tx_busy(void) {
    return tx_busy;
}

/* Interrupt handlers */

void USART2_IRQHandler(void) {
    uint32_t sr = USART2->SR;
    
    /* Handle RX not empty */
    if (sr & SR_RXNE) {
        char ch = (char)(USART2->DR & 0xFF);
        if (rx_callback != NULL) {
            rx_callback(ch);
        }
    }
    
    /* Handle idle line detection */
    if (sr & SR_IDLE) {
        /* Clear IDLE flag by reading SR then DR */
        (void)USART2->DR;
    }
    
    /* Handle overrun error */
    if (sr & SR_ORE) {
        error_flags.overrun_error = 1;
        /* Clear ORE by reading SR then DR */
        (void)USART2->DR;
    }
    
    /* Handle framing error */
    if (sr & SR_FE) {
        error_flags.framing_error = 1;
        /* Clear FE by reading SR then DR */
        (void)USART2->DR;
    }
    
    /* Handle noise error */
    if (sr & SR_NF) {
        error_flags.noise_error = 1;
        /* Clear NF by reading SR then DR */
        (void)USART2->DR;
    }
}

void DMA1_Stream6_IRQHandler(void) {
    /* Check if transfer complete interrupt */
    if (DMA1->HISR & DMA_HISR_TCIF6) {
        /* Clear transfer complete flag */
        DMA1->HIFCR = DMA_HIFCR_CTCIF6;
        
        /* Mark TX as not busy */
        tx_busy = 0;
        
        /* Call user callback if registered */
        if (tx_complete_callback != NULL) {
            tx_complete_callback();
        }
    }
}

/* Private function implementations */

static uint16_t compute_uart_bd(uint32_t periph_clk, uint32_t baudrate) {
    return ((periph_clk + (baudrate / 2U)) / baudrate);
}

static void uart_set_baudrate(uint32_t periph_clk, uint32_t baudrate) {
    USART2->BRR = compute_uart_bd(periph_clk, baudrate);
}

static void uart_dma_init(void) {
    /* Enable DMA1 clock */
    RCC->AHB1ENR |= DMA1EN;
    
    /* Disable DMA1 Stream 6 before configuration */
    DMA1_Stream6->CR &= ~DMA_SxCR_EN;
    
    /* Wait until stream is disabled */
    while (DMA1_Stream6->CR & DMA_SxCR_EN);
    
    /* Configure DMA Stream 6 for USART2_TX */
    DMA1_Stream6->CR = 0;  // Reset configuration
    DMA1_Stream6->CR |= DMA_SxCR_CHSEL_CH4;      // Channel 4 (USART2_TX)
    DMA1_Stream6->CR |= DMA_SxCR_MINC;           // Memory increment mode
    DMA1_Stream6->CR |= DMA_SxCR_DIR_MEM2PER;    // Memory to peripheral
    DMA1_Stream6->CR |= DMA_SxCR_TCIE;           // Transfer complete interrupt
    
    /* Set peripheral address (USART2 data register) */
    DMA1_Stream6->PAR = (uint32_t)&(USART2->DR);
    
    /* Memory address and data count will be set in uart_write_dma() */
}

static void uart_nvic_init(void) {
    /* Enable USART2 interrupt in NVIC */
    NVIC_EnableIRQ(USART2_IRQn);
    NVIC_SetPriority(USART2_IRQn, 2);  // Lower priority (higher number)
    
    /* Enable DMA1 Stream 6 interrupt in NVIC */
    NVIC_EnableIRQ(DMA1_Stream6_IRQn);
    NVIC_SetPriority(DMA1_Stream6_IRQn, 0);  // Higher priority (lower number)
    // DMA must have higher priority than UART to allow DMA completion 
    // interrupts to fire even when called from UART interrupt context
}

